[
    {
        "company": "HKUST JC STEM Lab of Data Science Foundations",
        "title": "Junior Research Assistant",
        "startDate": "June 2024",
        "endDate": "August 2024",
        "description": [
            "Collaborated with Hong Kong Air Cargo Terminals Limited (HACTL) to conduct root cause analysis of operational inefficiencies and optimize routing within their large-scale cargo handling system.",
            "Implemented reinforcement learning algorithms to optimize signaling, reducing congestion.",
            "Modeled spatio-temporal graph models that predicted cargo congestion with over 80% accuracy.",
            "Engineered an LLM agent for root cause analysis, achieving over 90% accuracy identifying complex scenario issues.",
            "Streamlined the congestion detection pipeline, reducing runtime by 50% and significantly improving efficiency.",
            "Enhanced data preprocessing pipeline for cargo movement data, reducing data errors from 25% to less than 1%."
        ]
    },
    {
        "company": "Dymon Asia Capital",
        "title": "Quant Research Intern",
        "startDate": "April 2024",
        "endDate": "June 2024",
        "description": [
            "Formulated time-series models integrating market sentiment for stock price prediction.",
            "Engineered automated ETL pipelines leveraging APIs, Selenium, and NLP libraries (e.g., NLTK, SpaCy) to efficiently acquire and process financial data from 5+ vendors, enhancing data availability for analysis.",
            "Optimized data loading pipelines, improving data accuracy by 25%, and maintained 50+ database schemas for efficient market data storage and retrieval."
        ]
    },
    {
        "company": "Optix Solutions Ltd",
        "title": "AI R&D Intern",
        "startDate": "June 2023",
        "endDate": "August 2023",
        "description": [
            "Led a team of three interns to develop a full-stack large language model application for DBS Bank.",
            "Orchestrated code reviews, daily meetings, ensuring project milestone achievement.",
            "Fine-tuned LLMs like BERT for document classification and sentiment analysis tasks.",
            "Architected a topic tagging pipeline using LLMs for MTR Corp.'s NLP project, increasing accuracy by 14%."
        ]
    }
]